Tekla Open API Reference for Tekla Structures 2025
PolyBeam Constructor
Overload List
Name | Description
PolyBeam()
 Initializes a new instance of the PolyBeam class.
PolyBeam(PolyBeam.PolyBeamTypeEnum)
 Initializes a new instance of the PolyBeam class by using the defined type.
Top
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace